/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "値が無効です。";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "値“%@”が無効です。";

/* NSFormattingError */
"Err2048-C" = "フォーマットエラー。";

/* NSFileLockingError */
"Err255-C" = "ファイルをロックできませんでした。";

/* NSFileLockingError */
"Err255-R" = "ファイルはすでにロックされているか、またはファイルをロックするためのアクセス権がない可能性があります。";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "ファイル“%@”をロックできませんでした。";

/* NSFileReadUnknownError */
"Err256" = "ファイルを開けませんでした。";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "ファイル“%@”を開けませんでした。";

/* NSFileReadNoPermissionError */
"Err257" = "適切なアクセス権がないため、ファイルを開けませんでした。";

/* NSFileReadNoPermissionError */
"Err257-C" = "適切なアクセス権がありません。";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "アクセス権を表示または変更するには、“Finder”で項目を選択し、“ファイル”＞“情報を見る”と選択してください。";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "適切なアクセス権がないため、ファイル“%@”を開けませんでした。";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "ファイル名が正しくありません。";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "ファイル名“%@”が無効であるため、項目を開けませんでした。";

/* NSFileReadCorruptFileError */
"Err259" = "フォーマットが正しくないため、ファイルを開けませんでした。";

/* NSFileReadCorruptFileError */
"Err259-C" = "ファイルのフォーマットが正しくありません。";

/* NSFileReadCorruptFileError */
"Err259-R" = "ファイルが破損しているか切り取られていたり、またはファイルのフォーマットが異なる可能性があります。";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "フォーマットが正しくないため、ファイル“%@”を開けませんでした。";

/* NSFileReadNoSuchFileError */
"Err260-C" = "ファイルがありません。";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "ファイル“%@”は存在しません。";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "指定されたテキストエンコーディングでファイルを開けませんでした。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "指定されたテキストエンコーディングには対応していません。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "テキストエンコーディング %@ には対応していません。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "このファイルは、別のテキストエンコーディングで保存されているか、テキストファイルでない可能性があります。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "テキストエンコーディング %@ でファイルを開けませんでした。";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "テキストエンコーディング %1$@ でファイル“%2$@”を開けませんでした。";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "指定された URL タイプに対応していないため、ファイルを開けませんでした。";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "指定された URL タイプに対応していません。";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "URL タイプ %2$@ に対応していないため、ファイル“%1$@”を開けませんでした。";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "URL タイプ %@ に対応していないため、ファイルを開けませんでした。";

/* NSFileReadTooLargeError */
"Err263" = "ファイルが大きすぎるため、開けませんでした。";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "ファイルが大きすぎます。";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "ファイル“%@”は大きすぎるため開けませんでした。";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "コンテンツのテキストエンコーディングを判別できなかったため、ファイルを開けませんでした。";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "コンテンツのテキストエンコーディングを判別できませんでした。";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "テキストエンコーディングを明示的に指定すれば、ファイルを開ける可能性があります。";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "コンテンツのテキストエンコーディングを判別できなかったため、ファイル“%@”を開けませんでした。";

/* NSUserCancelledError */
"Err3072-C" = "操作がキャンセルされました。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@”を取り除けませんでした。";

/* NSFileNoSuchFileError */
"Err4-C" = "ファイルがありません。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "ファイル“%@”は存在しません。";

/* NSFileWriteUnknownError */
"Err512" = "ファイルを保存できませんでした。";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@”を“%2$@”にコピーできませんでした。";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@”を“%2$@”にリンクできませんでした。";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@”を“%2$@”に移動できませんでした。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@”を取り除けませんでした。";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "ファイル“%2$@”をフォルダ“%1$@”に保存できませんでした。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "ファイル“%@”を保存できませんでした。";

/* NSFileWriteNoPermissionError */
"Err513" = "適切なアクセス権がないため、ファイルを保存できませんでした。";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%2$@”に対する適切なアクセス権がないため、“%1$@”をコピーできませんでした。";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%2$@”に対する適切なアクセス権がないため、“%1$@”をリンクできませんでした。";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%2$@”に対する適切なアクセス権がないため、“%1$@”を移動できませんでした。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "適切なアクセス権がないため、“%@”を取り除けませんでした。";

/* NSFileWriteNoPermissionError */
"Err513-C" = "適切なアクセス権がありません。";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "アクセス権を表示または変更するには、“Finder”で項目を選択し、“ファイル”＞“情報を見る”と選択してください。";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "ファイル“%2$@”をフォルダ“%1$@”に保存するためのアクセス権がありません。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "ファイル“%@”を保存するためのアクセス権がありません。";

/* NSFileWriteInvalidFileNameError */
"Err514" = "ファイル名が無効であるため、項目を保存できませんでした。";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "ファイル名“%@”が無効であるため、項目を取り除けませんでした。";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "ファイル名が正しくありません。";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "ファイル名“%@”が無効であるため、項目を保存できませんでした。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "指定されたテキストエンコーディングでファイルを保存できませんでした。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "指定されたテキストエンコーディングには対応していません。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "テキストエンコーディング %@ には対応していません。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "可能な場合は、別のテキストエンコーディングを選んでください。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "テキストエンコーディング %@ でファイルを保存できませんでした。";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "テキストエンコーディング %1$@ でファイル“%2$@”を保存できませんでした。";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "指定された URL タイプに対応していないため、ファイルを保存できませんでした。";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "指定された URL タイプに対応していません。";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "URL タイプ %2$@ に対応していないため、ファイル“%1$@”を保存できせんでした。";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "URL タイプ %@ に対応していないため、ファイルを保存できませんでした。";

/* NSFileWriteOutOfSpaceError */
"Err640" = "空き領域が不足しているので、ファイルを保存できませんでした。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "空き領域が不足しているため、“%1$@”を“%2$@”にコピーできませんでした。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "空き領域が不足しているため、“%1$@”を“%2$@”にリンクできませんでした。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "空き領域が不足しているため、“%1$@”を“%2$@”に移動できませんでした。";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "空き領域が不足しています。";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "ボリューム“%@”の空き領域が不足しています。";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "ボリュームからファイルをいくつか取り除いて、もう一度やり直してください。";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "空き領域が不足しているため、ファイル“%@”を保存できません。";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "ボリューム“%2$@”の空き領域が不足しているため、ファイル“%1$@”を保存できません。";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "操作を完了できませんでした。（%1$@ エラー %2$ld）";

